{
  "architectures": ["LlamaForCausalLM"],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 128000,
  "eos_token_id": [128001, 128008, 128009],
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 14336,
  "max_position_embeddings": 131072,
  "mlp_bias": false,
  "model_type": "llama",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "pad_token_id": 0,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-5,
  "rope_scaling": {
    "factor": 8.0,
    "high_freq_factor": 4.0,
    "low_freq_factor": 1.0,
    "original_max_position_embeddings": 8192,
    "rope_type": "llama3"
  },
  "rope_theta": 500000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.51.3",
  "use_cache": true,
  "vocab_size": 128256,
  "neuron_config": {
    "_serialized_key": "NxDNeuronConfig",
    "async_mode": false,
    "attn_kernel_enabled": false,
    "batch_size": 1,
    "capacity_factor": null,
    "cc_pipeline_tiling_factor": 2,
    "checkpoint_id": "meta-llama/Llama-3.1-8B-Instruct",
    "checkpoint_revision": "0e9e39f249a16976918f6564b8830bc894c89659",
    "continuous_batching": false,
    "enable_bucketing": false,
    "ep_degree": 1,
    "flash_decoding_enabled": false,
    "fused_qkv": true,
    "glu_mlp": true,
    "is_chunked_prefill": false,
    "local_ranks_size": 2,
    "logical_nc_config": 1,
    "max_batch_size": 1,
    "max_context_length": 4096,
    "max_topk": 256,
    "mlp_kernel_enabled": false,
    "mlp_kernel_fuse_residual_add": false,
    "n_active_tokens": 4096,
    "neuronxcc_version": "2.17.194.0+d312836f",
    "num_cores_per_group": 1,
    "on_device_sampling": true,
    "optimum_neuron_version": "0.2.2",
    "output_logits": false,
    "padding_side": "right",
    "pp_degree": 1,
    "qk_layernorm": false,
    "qkv_kernel_enabled": false,
    "rpl_reduce_dtype": "float16",
    "sequence_length": 4096,
    "sequence_parallel_enabled": false,
    "speculation_length": 0,
    "start_rank_id": 0,
    "target": null,
    "torch_dtype": "float16",
    "tp_degree": 2,
    "vocab_parallel": false
  },
  "_name_or_path": "meta-llama/Llama-3.1-8B-Instruct"
}
